// Lab_02.cpp
// Бойко Марія
// Лабораторна робота № 2.
// Лінійні програми.
// Варіант 1

#include <iostream> // Щоб комп'ютер міг виводити текст на екран
#include <cmath>    // Щоб комп'ютер розумів синус (sin), косинус (cos) та квадрат (pow)

using namespace std;

int main()
{
    // 1. Створюємо число Пі
    double Pi = 4 * atan(1.0);

    // 2. Створюємо змінні для чисел
    double alpha; // число, яке введемо з клавіатури
    double z1;    // Результат першої формули
    double z2;    // Результат другої формули

    // 3. Просимо ввести значення alpha
    cout << "alpha = ";
    cin >> alpha;

    // 4. Переписуємо першу формулу з картинки мовою C++
    z1 = 2 * pow(sin(3 * Pi - 2 * alpha), 2) * pow(cos(5 * Pi + 2 * alpha), 2);

    // 5. Переписуємо другу формулу з картинки мовою C++
    z2 = 1.0 / 4.0 - (1.0 / 4.0) * sin((5.0 / 2.0) * Pi - 8 * alpha);

    // 6. Виводимо результати на екран, щоб порівняти їх
    cout << endl;
    cout << "z1 = " << z1 << endl;
    // cout << "z2 = " << z2 << endl;

    cin.get();
    return 0;
}
